//
//  CommunityPolicy.swift
//  TteoPpoKki4U
//
//  Created by Dongik Song on 6/28/24.
//

import Foundation

struct CommunityPolicy {
    let policy = """
제 1조 목적
본 약관은 개발자 팀 SwiftBreacker(이하 "운영진")에서 운영하는 떡볶이4U 내의 커뮤니티 서비스를 이용함에 있어 운영진과 커뮤니티 서비스를 이용하는 커뮤니티 구성원 사이에 커뮤니티 개설 및 운영에 관한 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.


제 2조 약관의 명시 및 변경
저희 운영진은 본 약관의 내용을 커뮤니티 구성원이 쉽게 알 수 있도록 커뮤니티 서비스를 제공하는 운영정책을 통해 확인 할 수 있도록 합니다. 운영진은 본 약관을 변경하는 경우에는 적용 일시 및 사유를 명시하여 사전에 커뮤니티 서비스를 제공하는 어플을 통해 공지합니다. 커뮤니티 구성원은 개정된 약관에 대해 거부할 권리가 있습니다. 커뮤니티 구성원이 개정된 약관에 동의하지 아니할 경우 커뮤니티 기능 및 어플 이용이 어려울 수 있으며, 개정된 약관의 효력발생일 이후에도 계속 이용하는 경우에는 약관의 변경사항에 대한 동의로 간주합니다.


제 3조 회사의 의무 및 권리
운영진은 정기점검 등 특별한 사유가 없는 한 지속적이고, 안정적으로 커뮤니티 서비스를 제공하기 위하여 최선을 다합니다. 개발팀은 본 약관 제6조의 각 호에 규정된 내용으로 이용되는지 여부를 임의로 모니터링 할 수 있습니다. 운영진은 해당 커뮤니티의 활동에 적절하다고 판단되거나 활용가능성 있는 정보와 광고를 커뮤니티 서비스 내에 게재할 수 있습니다.


제4조 커뮤니티 구성원, 운영진(SwiftBreackers 팀)의 의무 및 활동
커뮤니티에 가입 시 제출한 개인정보는 커뮤니티 운영진의 책임과 권한 하에 관리, 운영됩니다. 커뮤니티 운영진은 커뮤니티 구성원의 동의 없이 회원의 개인정보를 공개하거나 커뮤니티 관리 이외의 목적으로 이용할 수 없으며, 이에 대한 책임을 집니다. 커뮤니티 구성원의 읽기, 쓰기, 수정, 삭제 등의 권한은 해당 커뮤니티 운영진이 관리하며, 운영진은 본 약관 제 5조의 각 호에 규정한 내용으로 커뮤니티를 이용하거나 이에 해당하는 자료를 게재할 수 없도록 지속적으로 건전하게 관리 합니다. 커뮤니티에 본 약관 제5조의 각 호에 해당되는 자료가 게재되었을 경우 커뮤니티 구성원은 즉시 이를 커뮤니티 운영진에 신고를 하여야 합니다. 이에 커뮤니티 운영진은 해당 자료를 발견 또는 신고 받으면 모니터링을 통하여 해당 자료를 삭제하여야 합니다.


제 5조 이용제한 및 중지
다음 각 호에 대하여는 사전통지 없이 커뮤니티 서비스 이용을 제한 및 적법한 조치를 취할 수 있으며, 커뮤니티 서비스를 정지할 수 있습니다.
● 음란하거나 공공질서 또는 미풍양속에 반하는 부호, 문언 또는 사진을 배포, 판매, 임대하거나 공공연하게 전시하는 내용을 포함하는 게시물
● 사람을 비방할 목적으로 공공연하게 사실이나 거짓의 사실을 드러내어 타인의 명예를 훼손하는 내용의 정보를 포함하는 게시물
● 정당한 사유 없이 정보통신시스템, 데이터 또는 프로그램 등을 훼손, 멸실, 변경, 위조하거나 그 운용을 방해하는 내용의 정보를 포함하는 게시물
● 청소년 보호법에 따른 청소년유해매체물로서 상대방의 연령 확인, 표시의무 등 법령에 따른 의무를 이행하지 아니하고 영리를 목적으로 제공하는 내용의 정보를 포함하는 게시물
● 법령에 따라 금지되는 사행행위에 해당하는 내용의 정보를 포함하는 게시물
● 개인정보 보호에 관한 법령을 위반하여 개인정보를 거래하는 내용의 정보를 포함하는 게시물
● 총포, 화약류(생명, 신체에 위해를 끼칠 수 있는 폭발력을 가진 물건을 포함)를 제조할 수 있는 방법이나 설계도 등의 정보를 포함하는 게시물
● 법령에 따라 분류된 비밀 등 국가기밀을 누설하는 내용의 정보를 포함하는 게시물
● 범죄를 목적으로 하거나, 교사 또는 방조하는 내용의 정보를 포함하는 게시물
● 운영진의 담당자 등 권한 있는 자를 사칭하거나 제3자의 명의를 도용하여 작성한 게시물
● 다른 이용자나 제3자에 대한 모욕 또는 욕설을 포함하는 게시물
● 정당한 서비스 제공 및 이용을 방해할 목적으로 동일하거나 유사한 내용을 반복적으로 게재하는 게시물


제 6조 게시물의 저작권 및 관리
운영진은 커뮤니티 구성원의 게시물을 소중하게 생각하며 변조, 훼손, 삭제되지 않도록 최선을 다해 보호합니다. 다만, 다음 각 호에 해당하는 경우 사전통지 없이 해당 게시물 을 삭제할 수 있고, 해당 커뮤니티에 대한 이용제한 및 중지를 할 수 있습니다.
● 커뮤니티 구성원이 정당한 권한이나 권원 없이 해당 프로그램 저작권자들의 프로그램 등을 복제, 제거, 변경하거나 게시, 전송, 링크 배포하는 경우
● 저작자의 실명 또는 익명을 변경 또는 은닉하거나 해당 프로그램의 제호를 변경하여 저작권자의 허락 없이 게시, 게재하는 경우
● 운영진 사정으로 인해 커뮤니티 서비스를 정상적으로 제공할 수 없는 경우
전항의 저작권침해 및 기타의 불법행위로 발생하는 피해에 대하여 운영진은 책임을 지지 않습니다.


제 7조 면책조항
운영진은 본 약관에서 정한 것을 제외하고는 커뮤니티 서비스에 게재된 어떠한 의견이나 정보에 대하여도 대표성을 가지지 않으며, 커뮤니티 구성원이나 제3자가 표출한 의견을 승인, 반대 및 수정하지 않습니다. 커뮤니티 구성원은 커뮤니티 서비스에 게재된 정보를 스스로의 판단 하에서 자유롭게 이용할 권리가 있습니다. 또한 운영진은 어떠한 경우라도 커뮤니티 구성원이 커뮤니티 서비스에 게재된 정보에 의해 입은 손해나 피해에 대하여 책임을 지지 않습니다. 운영진은 커뮤니티 구성원의 커뮤니티 이용과 관련하 여회사의 고의 또는 중과실이 없는 한 커뮤니티 구성원에게 발생한 어떠한 손해에 대해서도 책임을 지지 않습니다. 운영진은 상시적으로 커뮤니티 게시물의 내용을 확인하거나 검토하지 아니하며, 이에 대한 의무나 그 결과에 대한 책임을 지지 않습니다.


처리방침 시행일
2024년 6월 28일 
"""
}
