//
//  privacyPolicyText.swift
//  TteoPpoKki4U
//
//  Created by 김건응 on 6/21/24.
//

import Foundation

struct privacyPolicyText {
    let privacytext = """
안녕하세요. 이용자 개인정보의 안전한 처리는 떡볶이4U 개발팀에게 가장 중요한 일 중 하나입니다.
여러분의 개인정보는 서비스의 원활한 제공을 위하여 수집됩니다.

법령에 의하거나 여러분이 별도로 동의하지 아니하는 한 떡볶이4U가 여러분의 개인정보를 제3자에게 제공하는 일은 결코 없습니다. 개인정보 처리방침의 변경시에는 이용자가 언제든지 그 내용과 이유를 쉽게 알 수 있도록 빠르게 업데이트 하겠습니다.


1. 개인정보의 처리 목적
‘떡볶이4U’('https://github.com/SwiftBreakers/TTEOPPOKKI4U')는 앱의 설치시에 이용자가 동의한 권한에 따라 서비스의 기본 기능을 제공합니다.
① 다음의 목적을 위하여 개인정보를 처리하고 있으며, 이외의 용도로는 정보를 이용 및 처리하지 않습니다.
1) 위치 기반 서비스 제공 및 기능 개선
2) 법령이나 이용약관에 반하는 이용행위 및 이용자들에게 피해를 줄 수 있는 이용행위의 방지

2. 처리하는 개인정보 항목
① ‘떡볶이4U’는 다음의 개인정보 항목을 처리하고 있습니다.
1) 사진, GPS, 이메일, 프로필 이미지 등이 선택적으로 수집됩니다.

3. 개인정보 수집 방법
앱의 이용을 위해 이용자의 동의 항목에 한해 개인정보를 수집합니다.

4. 개인정보 자동 수집 장치의 설치·운영 및 거부에 관한 사항
'떡볶이4U'는 정보주체의 이용정보를 저장하고 수시로 불러오는 '쿠키'를 사용하지 않습니다.

5. 정보주체와 법정대리인의 권리·의무 및 그 행사방법
① 정보주체는 회사에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
1) 개인정보 열람 요구
2) 오류 등이 있을 경우 정정 요구
3) 삭제 요구

6. 개인정보의 처리 및 보유기간
① '떡볶이4U'는 법령에 따른 개인정보 보유·이용기간 또는 이용자로 부터 개인정보를 수집 시에 동의 받은 개인정보 보유·이용기간 내에서 개인정보를처리·보유합니다.
② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
1) 회원 가입 및 관리 : 탈퇴 요청시 까지
가. 관계 법령 위반에 따른 수사․조사 등이 진행 중인 경우에는 해당 수사․조사 종료 시 까지
나. 스마트폰 앱 이용에 따른 채권․채무관계 잔존 시에는 해당 채권·채무관계 정산 시 까지
2) 재화 또는 서비스 제공 : 재화·서비스 공급완료 및 요금결제․정산 완료 시 까지
다만, 다음의 사유에 해당하는 경우에는 해당 기간 종료 시 까지
가.「전자상거래 등에서의 소비자 보호에 관한 법률」에 따른 표시·광고, 계약내용 및 이행 등 거래에 관한 기록
나.「통신비밀보호법」 제41조에 따른 통신사실 확인자료 보관

7. 개인정보의 파기
① '떡볶이4U'는 원칙적으로 개인정보 처리 목적이 달성된 경우에는 지체 없이 해당 개인정보를 파기합니다.
② 개인정보 파기의 절차 및 방법, 기한은 다음과 같습니다.
1) 파기절차 및 방법
이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져 내부 방침 및 기타 관련 법령에 따라 일정 기간 저장된 후 혹은 즉시 파기됩니다. 이때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.
2) 파기기한
이용자의 개인정보는 개인정보의 보유 기간이 경과된 경우에는 보유 기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.

8. 개인정보보호 책임자 작성
① '떡볶이4U' 개발팀 'Swiftbreakers'는 개인정보 처리에 관한 업무를 총괄하여 책임집니다. 개인정보 처리와 관련한 정보주체의 불만 처리 및 피해 구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
이름: 박미림
직책: 개발자
홈페이지: [https://laced-brand-a7e.notion.site/4U-17cc2f5674f2452b91216fbd17b7cfa9]
이메일: mirimp25@naver.com

9. 개인정보의 안전성 확보 조치
'떡볶이4U'는 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적·관리적 및 물리적 조치를 하고 있습니다.
① 비인가자에 대한 DB에의 접근 통제를 위한 기술적, 물리적 조치를 하고 있습니다.


이 개인정보처리방침은 시행일로부터 적용됩니다.

'떡볶이4U'는 법률이나 서비스의 변경사항을 반영하기 위한 목적 등으로 개인정보 처리방침을 수정할 수 있습니다. 개인정보 처리방침이 변경되는 경우 '떡볶이4U'는 변경 사항을 게시하며, 변경된 개인정보 처리방침은 게시한 날로부터 7일 후부터 효력이 발생합니다.

일자: 2024년 6월 18일

'떡볶이4U'에서 제공하는 서비스에 대한 개인정보 처리방침 입니다.

"""
    
}
